## 구구단 (예습)
print('\n--------------------------------------')

for x in range(1, 10) :
    for y in range(1, 10) :
        print(f'{x} * {y} = {x*y}')
    print(' ')


## 구구단 프로그램
# 2x1 = 2 ... 2x9=18
# 3x1 = 3 ... 3x9=27
#             9x9=81
print('\n--------------------------------------')

print('---구구단 프로그램---\n')
for x in range(2, 10) :
    print(f'\n< {x}단 >')
    for y in range(1, 10) :
        print(f'{x}x{y}={x*y:2d}', end = '  ')
        # 2d : 정수(숫자를 2자리로 동일하게 맞춤), 0.2f : 소수(소수점 2자리로 맞춤), s : 문자
    print()     # 단마다 줄맞춤